test_questions = [
    {
        'text': 'Каким числом следует заменить знак вопроса?\n25 29 33 37 41 ?',
        'answers': {
            '44': -5,
            '43': -5,
            '45': 7,
            '46': -5,
            '42': -5
        }
    },
    {
        'text': 'Что здесь является лишним?',
        'answers': {
            'ЛЕВ': -5,
            'ТИГР': -5,
            'ГЕПАРД': -5,
            'ПУМА': -5,
            'ГИЕНА': 7
        }
    },
    {
        'text': 'Какой буквой следует заменить знак вопроса?\nБ Г Е Ж И ?',
        'answers': {
            'К': 7,
            'М': -5,
            'Л': -5,
            'Ъ': -5,
            'Н': -5
        }
    },
    {
        'text': 'Выберите рисунок, который необходимо добавить вместо знака вопроса.',
        'image': 'images/1.png',
        'answers': {
            '1': -5,
            '2': 7,
            '3': -5,
            '4': -5
        }
    },
    {
        'text': 'Найдите слово, которое необходимо вставить в скобки, чтобы закончить первое слово и начать последнее слово. Какую букву содержит это слово?\nБАЛ ( . . . ) ТУР',
        'answers': {
            'Т': -5,
            'М': -5,
            'С': -5,
            'Н': 7,
            'А': -5
        }
    },
    {
        'text': 'Какими двумя числами следует заменить знаки вопроса?\n12 17 15 20 18 ? ?',
        'answers': {
            '20  22': -5,
            '22  20': -5,
            '23  20': -5,
            '23  21': 7,
            '24  21': -5
        }
    },
    {
        'text': 'Какие две буквы должны идти далее?\nБ Д Е З И Л ? ?',
        'answers': {
            'Н  О': -5,
            'М  П': 7,
            'Н  П': -5,
            'М  О': -5,
            'О  Р': -5
        }
    },
    {
        'text': 'Вместо многоточия необходимо вставить такое слово, которое вместе с другими словами образует новые слова. Что обозначает это слово?',
        'image': 'images/2.png',
        'answers': {
            'МЕТАЛЛ': -5,
            'ЗДАНИЕ': -5,
            'ЖИДКОСТЬ': 7,
            'ОДЕЖДА': -5,
            'ЖИВОТНОЕ': -5
        }
    },
    {
        'text': 'Сколько зеленых автомобилей в день производит автозавод?\nАвтозавод производит 1000 кузовов в день для белых, черных, зеленых и красных автомобилей в пропорции  4 : 8 : 7 : 1  соответственно.',
        'answers': {
            '320': -5,
            '340': -5,
            '380': -5,
            '365': -5,
            '350': 7
        }
    },
    {
        'text': 'Какие две буквы должны идти далее?',
        'image': 'images/3.png',
        'answers': {
            'Д  М': 7,
            'Е  Н': -5,
            'Г  Н': -5,
            'В  М': -5,
            'Е  О': -5
        }
    }
]